{
    "id": 1,
    "title": "13.772 billion years, That’s why we do not see them!",
    "image": "https://miro.medium.com/v2/resize:fit:640/format:webp/0*m_ejrwbdFOhCRcKA",
    "date": "2023-11-15",
    "author": "Conceived by : Benjamin G Nechicattu",
    "tags": ["Space", "Universe", "Life", "Aliens", "Extraterrestrial", "Intelligence"],
    "description": "Where are the aliens? Why we do not see them? Is there any life on other planets? How far is the universe? How long does it take to reach there? How long does it take to see them?",
    "content": "The age of the universe is approximately about 13.772 billion years, with an uncertainty of about 59 million years (according to 2011 studies). Wow! It's a large amount of time. The age of the Earth is about 4.543 billion years. And life originated back 3.7 billion years ago. 243 million years ago, dinosaurs ruled the Earth. Why do I need to remind you about this time chart? Yes, there is a reason. Now assume, you are on a planet that orbit Icarus, whose official name is MACS J1149+2223 Lensed Star 1, is the farthest individual star ever seen. It takes nine billion years for its shining light to reach Earth. When we look out for Earth from Icarus, we won't see life on Earth. Because we see the Earth which is far beyond the time since it takes 9 billion years for the light to reach there. That means if we want to see  Dinosaurs on Earth we have to wait for at least for more than 8.5 billion years. Even to see the first life form on Earth it takes 5.3 billion years of waiting. Observing From Earth…. Similarly, when we are on Earth, querying for life on some other planet, which is on a faraway star system, like Icarus, we can't find life so easily. Assume both planets have the same age and same conditions for the support for life. It will take 9 billion years to make sure that there exists life in both planets. Which is not yet half of its way. So, we cannot make sure that there does or doesn't exist a similar planet that supports life! This is complicated! Assume If Earth is the first planet to support life since the birth of the universe, there is a little chance of finding a planet that supports life. Because the Universe is so big and distance between the probable planets are very large to our imagination. If we find an Earth-like planet at that distance, we can't make sure there exists life. Besides, the conditions of a star system are always changing. If we assume that the Sun's rate of nuclear fusion today is the same as the average rate over those 10 billion years, then we're moving away from the Sun at the rate of ~1.5 cm per year. It means, perhaps several billion years ago life on Earth was for sure not possible because it's too hot there. Like what we see now, in a faraway star system and their planets. So pretending what we see now and what happens on our planet and star system, there is a huge possibility for the existence of life on a faraway system. We aren't knowing it. Maybe they too. Even if we or they sent messages using a big radio telescope, it is of no use until 9 billion years (assuming the planet lies in Icarus Star system). Grab a glimpse at a closer planet….. Okay, let's consider a closer planet, which has a distance of about time when life started originating (distance in light years). Always life starts with microbes. When we consider this planet, we can't send a rover to collect samples, because of far distance. When we use our telescopes to develop the images of this Microbial or even higher cellular life forms we see nothing but the sand and rocks. We cannot see them as we expect. Moreover, life forms may vary in all aspects of its functions and the structure. Because it is not the Earth or the Solar System either. Environment, climate, gravity, everything differs, so the lifeforms too. Conclusion What here explained is a probable scenario that could happen in our neighborhood Space. It's just an illustration for a normal man to understand what the universe is and how far is it. Also, what is our role and how much do we occupy in this universe. Possibility of the existence of Extraterrestrial intelligence or life. There are a lot more planets between Earth and Icarus, more closer to Earth. But, we have to consider the limits we face. Limits in technology and limits of how far we can see. Through these, we can raise the probability of the existence of life rather than earth, even though we have no clues. Comparing the probable ways of the birth of a star system and planets, we could ensure the existence of life forms even without seeing them. But still it's a probability, it's a chance!"
}