{
    "id": 0,
    "title": "Extra-terrestrial Life Forms",
    "image": "https://miro.medium.com/v2/resize:fit:640/format:webp/1*ZG2IQzv1NbxlEjm84SBH9g.png",
    "date": "Jun 8, 2019",
    "author": "Concieved by Benjamin G Nechicattu",
    "tags": ["Extra-terrestrial", "Life Forms", "Space", "Science", "Physics"],
    "description": "Do ETL exist? How do they look like? How do they survive? Do they eat dimond cookies? Do they have Sulphur rains? This blog is an attempt to answer these questions.",
    "content": "Life forms and its environment can be related to 'Scales' in a musical Theory. Different scales can be used to play the same song but in different tone. Likewise the life forms and its environment are distinctly related. For us, we are carbon based life forms and our environment is such a way designed for us to survive. But there must exist an environment that has life forms that is related to that particular environment. Music or the rhythm may be same but the block note that makes the music is transposed by some other values that make it similar but with a different frequency or note. This is what happens in case of life forms in the universe. We may find life forms similar to us in some other 'octave' or some other 'note'. And in this case, if we are looking for carbon based life forms in the vast universe the probability of finding it will be much lesser, compared to other elemental life forms. Moreover these different life forms may not go together in same environment, it may be like pouring water in sulphuric acid. These forms may not survive in same environment. Lucky! That aliens won't come to us, probably it's a mere chance that an alien species coming to us and concurring the world. But we cannot just push it away, it's a chance! An artist impression on ET Space EnvironmentThere is hundred percent chance that there exist an extra-terrestrial life form, may not be based on Earthly Elements, but more than we expect. So searching for a life form outside earth is not like searching for it inside. We really have to come up with a new way, like expecting a life form based on some other element, say Oxygen, and assume its goods and bads! Like too acidic is harmful for us in carbon form, neutral water is good. When we notice such Environment around in the near stars or galaxy, we can predict the chance of Extra-terrestrial life. An artist impression on ET Space EnvironmentLooking for the right distance from the Star, for the life form to survive is just absurd that it's for the carbon based forms. But some other elemental life form can survive farther or too closer to the star than us. Looking for the right distance and weather means we can survive there. So searching for different elemental life form is the better way to confirm ETL (Extra Terrestrial Life Forms). Sometime ETL may not be with the same 'music' in some other scale. Music can be different. We may not find ETL that eat food, may be they don't even need food, there may not exist even trees. There is no need of chlorophyll, since they are not like us in earth and sun. Anything that exit anywhere in the universe regarding the Chemistry and the Biology, varies verity. There is a lot of combinations of Chemical bonds literary possible, like there are so many different music's with the same 12 black and white keys of the piano. Comparing the topic of discussion with the music theory is to make it understandable, the wide and complex topic, in a better way. This topic is more complex that it has more than 120 elements in the periodic table with unique and distinguished characters, which is more complex than 12 notes in a piano. Every combinations of elements creates different results. So in a vast universe with many more undiscovered carbon like elements, it is even more probable to find out an ETL with more different characteristics than us. An artist impression on ET Space EnvironmentWe have to search them from a different perspective. Maths does make a chance to look into n dimension in space. Likewise there is a way to peek into the space with a different perspective. There must exist a life form rather different from us, very different from us. This may be the same case happening for them (ETL) too. They find us useless for them or they cannot see us in our perspective."
}