{
    "id": 4,
    "title": "Where does Education Failed? !",
    "image": "https://miro.medium.com/v2/resize:fit:640/format:webp/1*Lmbw2vPZHH-FPAjb5j9UCA.jpeg",
    "date": "Jun 9, 2019",
    "author": "Benjamin G Nechicattu",
    "tags": ["Education", "Science", "Physics", "Maths"],
    "description": "Is Education a failure? Is it a system that is not working? ",
    "content": " I would like to begin with a statement someone said, ‘Students Must be taught how to think, Not What to think’. Einstein took at least 45 years before his death to make his great predictions that changed the worlds perspective seeing the universe. Every time he was learning. Now in this era, kids of age 10, are capable of doing great things. Consider a world wide scenario. A child is now capable of seeing a YouTube video him self, he/she can upload videos, search for videos they like. How do they learn it? Remember he/she is 10. May be in 5th grade. Still they are forced to do simple boring math! Forced to copy write, to improve there hand writing! They are a different evolving generation, look at their eyes! its written. They are not like us! They are living in a different world than before generation. Evolution is happening in Us too! And this is How it happens. These kids are capable of doing great things. But whats happening is disappointing! We see them like ourselves. Wrong, Its a great mistake.  can you make this one also  a one line markdown They are a better adapted, evolved generation. If These kids want to come up with new things, may be a new innovation, they would have to travel a very long distance in there life. For a new Einstein to be made from these generations, they have to cover all the areas that the real Einstein went. It took least 45 year for him. For a new Charles Darwin, it will take the half age of him. If these Kids were spoiled like this, no one can discover more than Einstein or Darwin. As we have seen the environment around is changing. As more powerful technology has been introduced, human life is changing. The generations are evolving, with more greater capacities than its previous generation. When we make syllabus for them, we have to keep in mind that they are not the same copy of us. They have something more than us. A boy who is able to browse internet at age of 13 is of course capable of understanding physics more deeper. Teach them something more different let the interested students feel the power of real math and science! let them know what is Integration for? When we force these generation to learn something like we do we are slowing them down. Take them to the world of real physics. This is why because, if they can understand something Einstein took Years to explain, at the age of 18 or 22, they are capable to discover more. But whats happening is slow, if these kids took as much time as Sir, Einstein took, they would be dead without nothing more! To avoid this carve them in a more different way so that they can hold more water in the pot! I am not compelling to make students learn Science, but compelling them to grab more at those age. Because they can, they are evolving. Science tells us Evolution is Such a Slow process. Comparing it with flow of generations and changes in the environment they lives strongly Suggest that, this change has to occur."
}