{
    "id": 5,
    "title": "What is Asgardia?; എന്താണ് അസ്ഗാർഡിയ?",
    "image": "https://miro.medium.com/v2/resize:fit:640/format:webp/1*Ucr9utAwVSRf1cAthIDzMQ.png",
    "date": "Jun 11, 2019",
    "author": "Benjamin G Nechicattu",
    "tags": ["SCI-FI", "Asgardia", "Space Nation", "Space", "Astrophysics", "Astrobiology"],
    "description": "Is it possible to have a country in space? Asgardia is the first space nation. It is a dream of a Russian scientist Igor Ashurbeyli. Asgardia is a country in space.",
    "content": "എന്താണ് അസ്ഗാർഡിയ? ഭൂമിയിൽ ഉള്ളതുപോല്ലേ തന്നെ ആകാശത്തും, അഥവാ ബഹിരാകാശത്തും ഒരു രാജ്യം ! അതെ , കേൾക്കുമ്പോൾ അതിശയം തോന്നിയേക്കാം, എങ്കിലും ഇത് സത്യം ആണ്. ഐഗോർ അശുർബെയ്‌ലിയെന്ന റഷ്യൻ വ്യവസായും ശാസ്ത്രജ്ഞനും ആണ് ഈ ആശയം മുന്നോട്ടു കൊണ്ട് വന്നത്.ഐഗോർ അശുർബെയ്‌ലിഇത് 21 ആം നൂറ്റാണ്ടു ശാസ്ത്രം അതിവേഗം സഞ്ചരിച്ചുകൊണ്ടു ഇരിക്കുന്നു. ബഹിരാകാശ സഞ്ചാരം നിഷ്പ്രയാസം. ഇങ്ങനെ ഒക്കെ ആയിരിക്കെ എന്തുകൊണ്ട് ഒരു വീട് ബഹിരകാശത്തു പണിതുകൂടാ? ഇതേ തുടർന്ന് സമ്പന്നൻ ആയ റഷ്യൻ ശാസ്ത്രജ്ഞൻ ഐഗോർ അശുർബെയ്‌ലി മുന്നോട്ടു കൊണ്ടുവന്ന ആശയം ആണ് ബഹിരാകാശ രാജ്യം. ![asher](https://miro.medium.com/v2/resize:fit:640/format:webp/1*ozVztkE3VmXBWJcyxkbNxA.jpeg) ആ രാജ്യത്തിനു ഒരു പേരും ഇട്ടു “അസ്ഗാർഡ്യ”. ഓസ്ട്രിയല്ലേ വിയന അടിസ്ഥാനമാക്കി അസ്ഗാർഡ്യ പ്രവർത്തിച്ചു വരുന്നു. ലോകത്തിൽ എവിടെനിന്നു ഉള്ളവർക്കും ഇവിടെ പങ്കാളി ആവാം. അതിനായി ഇത്രമാത്രം, അസ്ഗാർഡ്യ സ്പേസ് നേഷൻ എന്ന വെബ്സൈറ്റ് സന്നർഷിക്കുക. അതിൽ പറയുന്നപ്പോല്ലേ റെസിഡന്റ്‌സ് ആവുക, പിന്നീട് സിറ്റിസൺഷിപ് എടുക്കുക.“ശൂന്യാകാശത്തു എന്ന് ഒരു കുട്ടി ജനിക്കുന്നു അന്നുമുതൽ മനുഷ്യരാശി എന്നേക്കും ജീവിക്കും” ഇതാണ് അദ്ദേഹത്തിൻ്റെ നിഗമനം.2018 ഓട് കൂടി അസ്ഗാർഡ്യ 1 എന്ന സാറ്റലൈറ്റ് ഇതിനോട് അകം ഭ്രമണപഥത്തിൽ എത്തിക്കുകയും ചെയ്തു. അസ്ഗാർഡ്യയില ജനസംഘ്യ 1,055,614 ആവുകയും, താമസക്കാർ 18,435 ചെയ്തു. അസ്ഗാർഡ്യയോട് ഭാഗം ആവുന്നവർക്കു ഒരു സിറ്റിസൺ ഷിപ് സർട്ടിഫിക്കറ്റ് ലഭിക്കുകയും ചെയുന്നു. ഈ രാജ്യത്തിന് സ്വന്തമായി കറൻസിയും ഉണ്ട്. ബിറ്റ്‌കോയിൻ എന്ന ഡിജിറ്റൽ കറൻസി ആവിഷ്കരിക്കുന്ന ക്രിപ്റ്റോ കറൻസി സാങ്കേതിക വിദ്യ ആണ് ഇവിടെയും ഉപയോഗിച്ചിരിക്കുന്നത്. അസ്ഗാർഡ്യ സോൾ അല്ലെങ്കിൽ അസ്ഗാർഡ്യ സോളാർ എന്നും അറിയപ്പെടുന്നു. ഒരു സോൾന്നു ഒരു യൂറോ ആണ് വില്ല, അതായതു ഒരു സോൾനു 78 രൂപ വില വരും. ഇത് കൂടാതെ സ്വന്തമായി ദേശീയ ഗാനവും കൊടിയും എല്ലാം ഉണ് അസ്ഗര്ഡ്യക്കു!2019 ൽ അസ്ഗാർഡ്യ എക്സിക്യൂട്ടീവ് കോൺഗ്രസ് രൂപീകരിക്കുകയും ചെയ്തു. ഭൂമിയിൽ ഉള്ള ഏതൊരു രാജ്യത്തെ പോലെയും അസ്ഗാർഡ്യക്കും ഉണ്ട് കോൺസ്റ്റിട്യൂഷൻ. എക്സിക്യൂട്ടീവ് കോൺഗ്രസ് രൂപീകരിച്ചതിന്നു പുറമേ കോൺസ്റ്റിട്യൂഷൻ ഔദോഗികം ആകുകയും ചെയ്തു. 2,90,000 ത്തിൽ അതികം ആളുകൾ കോൺസ്റ്റിറ്റിട്യൂഷൻന്നെ അംഗീകരിക്കുകയും ചെയ്തു കഴിഞ്ഞിരിക്കുന്നു. ഇന്ത്യയിൽനിന്നും, കേരളത്തിൽ നിന്നും ആളുകൾ അസ്ഗാർഡ്യയോടു ചേർന്നിട്ടുണ്ട്. ഭൂമിക്കു പുറത്തു ഒരു രാജ്യം എന്നുള്ളത് ഇതുകൊണ്ടു സഫലം ആവുന്നു.എങ്കിലും ഇത് ഒരു തുടക്കം മാത്രം. അസ്ഗാർഡ്യ മുഴുവനായി സഫലം ആവാൻ ഇനിയും വർഷങ്ങൾ വേണ്ടിവരും! വർഷങ്ങൾ നീളുന്ന പരീക്ഷണങ്ങൾ, സാങ്കേതികാ മാറ്റങ്ങൾ ഇതിനു ആവശ്യം ആണ്. ഭൂമിക്കു പുറമേ ഒരു താമസസ്ഥലം ഒരുക്കുക എന്നത് വലിയ പ്രയാസകരമായ കാര്യമാണ്. അതിന്നു കോടികൾ ചിലവും വരുന്നുണ്ട്.ഭൂമിയില്ലേ വാസം താൽക്കാലികം ആണ്. ഒരിക്കൽ ഭൂമി മുഴുവനായി വാസയോഗ്യം അല്ലാതെ ആവുന്നു. അങ്ങനെ ഒരു അവസ്ഥ ഉണ്ടാവുമ്പോൾ മനുഷ്യന് വസിക്കുവാൻ ഒരിടം അതാണ് അസ്ഗാർഡ്യ. ഇത് ഒരു SCI-FI കഥയോ അഥവാ ഒരു സിനിമയോ അല്ല, ഇത് യാഥാർഥ്യം ആവുന്ന ഒരു സ്വപ്നം ആണ്."
}